examples/movingCone/Allrun-parallel
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

mapTimes="0.0015 0.003"

# Iterate the string variable using for loop
for mapTime in $mapTimes; do

    runApplication -a blockMesh -dict blockMeshDict_$mapTime
    runApplication -a decomposePar -force -noFields -dict decomposeParDict_$mapTime

    rm -rf constant/meshToMesh_$mapTime
    mkdir constant/meshToMesh_$mapTime

    for procI in processor*
    do
        mv $procI/constant/polyMesh constant/meshToMesh_$mapTime/$procI
    done

    mv constant/polyMesh constant/meshToMesh_$mapTime

done

runApplication -a blockMesh -dict blockMeshDict
runApplication -a decomposePar -force

for mapTime in $mapTimes; do

    for procI in processor*
    do
        mkdir $procI/constant/meshToMesh_$mapTime
        mv constant/meshToMesh_$mapTime/$procI $procI/constant/meshToMesh_$mapTime/polyMesh
    done

done

runParallel $(getApplication)
runApplication reconstructParMesh
runApplication reconstructPar

#------------------------------------------------------------------------------
